#include "des.h"
//#include "ldsw20.h"
#include "ldsw20.h"
#include "ldsw20rf.h"
#include <string.h>
#include "sha256.h"

extern sLDSW20Frame    sPointerOfLDSW20Frame[MAXchannelNumb];


/* the eight DES S-boxes */
const uint32_t SB1[64] =
{
    0x01010400, 0x00000000, 0x00010000, 0x01010404,
    0x01010004, 0x00010404, 0x00000004, 0x00010000,
    0x00000400, 0x01010400, 0x01010404, 0x00000400,
    0x01000404, 0x01010004, 0x01000000, 0x00000004,
    0x00000404, 0x01000400, 0x01000400, 0x00010400,
    0x00010400, 0x01010000, 0x01010000, 0x01000404,
    0x00010004, 0x01000004, 0x01000004, 0x00010004,
    0x00000000, 0x00000404, 0x00010404, 0x01000000,
    0x00010000, 0x01010404, 0x00000004, 0x01010000,
    0x01010400, 0x01000000, 0x01000000, 0x00000400,
    0x01010004, 0x00010000, 0x00010400, 0x01000004,
    0x00000400, 0x00000004, 0x01000404, 0x00010404,
    0x01010404, 0x00010004, 0x01010000, 0x01000404,
    0x01000004, 0x00000404, 0x00010404, 0x01010400,
    0x00000404, 0x01000400, 0x01000400, 0x00000000,
    0x00010004, 0x00010400, 0x00000000, 0x01010004
};
const U32 SB2[64] =
{
    0x80108020, 0x80008000, 0x00008000, 0x00108020,
    0x00100000, 0x00000020, 0x80100020, 0x80008020,
    0x80000020, 0x80108020, 0x80108000, 0x80000000,
    0x80008000, 0x00100000, 0x00000020, 0x80100020,
    0x00108000, 0x00100020, 0x80008020, 0x00000000,
    0x80000000, 0x00008000, 0x00108020, 0x80100000,
    0x00100020, 0x80000020, 0x00000000, 0x00108000,
    0x00008020, 0x80108000, 0x80100000, 0x00008020,
    0x00000000, 0x00108020, 0x80100020, 0x00100000,
    0x80008020, 0x80100000, 0x80108000, 0x00008000,
    0x80100000, 0x80008000, 0x00000020, 0x80108020,
    0x00108020, 0x00000020, 0x00008000, 0x80000000,
    0x00008020, 0x80108000, 0x00100000, 0x80000020,
    0x00100020, 0x80008020, 0x80000020, 0x00100020,
    0x00108000, 0x00000000, 0x80008000, 0x00008020,
    0x80000000, 0x80100020, 0x80108020, 0x00108000
};
const U32 SB3[64] =
{
    0x00000208, 0x08020200, 0x00000000, 0x08020008,
    0x08000200, 0x00000000, 0x00020208, 0x08000200,
    0x00020008, 0x08000008, 0x08000008, 0x00020000,
    0x08020208, 0x00020008, 0x08020000, 0x00000208,
    0x08000000, 0x00000008, 0x08020200, 0x00000200,
    0x00020200, 0x08020000, 0x08020008, 0x00020208,
    0x08000208, 0x00020200, 0x00020000, 0x08000208,
    0x00000008, 0x08020208, 0x00000200, 0x08000000,
    0x08020200, 0x08000000, 0x00020008, 0x00000208,
    0x00020000, 0x08020200, 0x08000200, 0x00000000,
    0x00000200, 0x00020008, 0x08020208, 0x08000200,
    0x08000008, 0x00000200, 0x00000000, 0x08020008,
    0x08000208, 0x00020000, 0x08000000, 0x08020208,
    0x00000008, 0x00020208, 0x00020200, 0x08000008,
    0x08020000, 0x08000208, 0x00000208, 0x08020000,
    0x00020208, 0x00000008, 0x08020008, 0x00020200
};
const U32 SB4[64] =
{
    0x00802001, 0x00002081, 0x00002081, 0x00000080,
    0x00802080, 0x00800081, 0x00800001, 0x00002001,
    0x00000000, 0x00802000, 0x00802000, 0x00802081,
    0x00000081, 0x00000000, 0x00800080, 0x00800001,
    0x00000001, 0x00002000, 0x00800000, 0x00802001,
    0x00000080, 0x00800000, 0x00002001, 0x00002080,
    0x00800081, 0x00000001, 0x00002080, 0x00800080,
    0x00002000, 0x00802080, 0x00802081, 0x00000081,
    0x00800080, 0x00800001, 0x00802000, 0x00802081,
    0x00000081, 0x00000000, 0x00000000, 0x00802000,
    0x00002080, 0x00800080, 0x00800081, 0x00000001,
    0x00802001, 0x00002081, 0x00002081, 0x00000080,
    0x00802081, 0x00000081, 0x00000001, 0x00002000,
    0x00800001, 0x00002001, 0x00802080, 0x00800081,
    0x00002001, 0x00002080, 0x00800000, 0x00802001,
    0x00000080, 0x00800000, 0x00002000, 0x00802080
};
const U32 SB5[64] =
{
    0x00000100, 0x02080100, 0x02080000, 0x42000100,
    0x00080000, 0x00000100, 0x40000000, 0x02080000,
    0x40080100, 0x00080000, 0x02000100, 0x40080100,
    0x42000100, 0x42080000, 0x00080100, 0x40000000,
    0x02000000, 0x40080000, 0x40080000, 0x00000000,
    0x40000100, 0x42080100, 0x42080100, 0x02000100,
    0x42080000, 0x40000100, 0x00000000, 0x42000000,
    0x02080100, 0x02000000, 0x42000000, 0x00080100,
    0x00080000, 0x42000100, 0x00000100, 0x02000000,
    0x40000000, 0x02080000, 0x42000100, 0x40080100,
    0x02000100, 0x40000000, 0x42080000, 0x02080100,
    0x40080100, 0x00000100, 0x02000000, 0x42080000,
    0x42080100, 0x00080100, 0x42000000, 0x42080100,
    0x02080000, 0x00000000, 0x40080000, 0x42000000,
    0x00080100, 0x02000100, 0x40000100, 0x00080000,
    0x00000000, 0x40080000, 0x02080100, 0x40000100
};
const U32 SB6[64] =
{
    0x20000010, 0x20400000, 0x00004000, 0x20404010,
    0x20400000, 0x00000010, 0x20404010, 0x00400000,
    0x20004000, 0x00404010, 0x00400000, 0x20000010,
    0x00400010, 0x20004000, 0x20000000, 0x00004010,
    0x00000000, 0x00400010, 0x20004010, 0x00004000,
    0x00404000, 0x20004010, 0x00000010, 0x20400010,
    0x20400010, 0x00000000, 0x00404010, 0x20404000,
    0x00004010, 0x00404000, 0x20404000, 0x20000000,
    0x20004000, 0x00000010, 0x20400010, 0x00404000,
    0x20404010, 0x00400000, 0x00004010, 0x20000010,
    0x00400000, 0x20004000, 0x20000000, 0x00004010,
    0x20000010, 0x20404010, 0x00404000, 0x20400000,
    0x00404010, 0x20404000, 0x00000000, 0x20400010,
    0x00000010, 0x00004000, 0x20400000, 0x00404010,
    0x00004000, 0x00400010, 0x20004010, 0x00000000,
    0x20404000, 0x20000000, 0x00400010, 0x20004010
};
const U32 SB7[64] =
{
    0x00200000, 0x04200002, 0x04000802, 0x00000000,
    0x00000800, 0x04000802, 0x00200802, 0x04200800,
    0x04200802, 0x00200000, 0x00000000, 0x04000002,
    0x00000002, 0x04000000, 0x04200002, 0x00000802,
    0x04000800, 0x00200802, 0x00200002, 0x04000800,
    0x04000002, 0x04200000, 0x04200800, 0x00200002,
    0x04200000, 0x00000800, 0x00000802, 0x04200802,
    0x00200800, 0x00000002, 0x04000000, 0x00200800,
    0x04000000, 0x00200800, 0x00200000, 0x04000802,
    0x04000802, 0x04200002, 0x04200002, 0x00000002,
    0x00200002, 0x04000000, 0x04000800, 0x00200000,
    0x04200800, 0x00000802, 0x00200802, 0x04200800,
    0x00000802, 0x04000002, 0x04200802, 0x04200000,
    0x00200800, 0x00000000, 0x00000002, 0x04200802,
    0x00000000, 0x00200802, 0x04200000, 0x00000800,
    0x04000002, 0x04000800, 0x00000800, 0x00200002
};
const U32 SB8[64] =
{
    0x10001040, 0x00001000, 0x00040000, 0x10041040,
    0x10000000, 0x10001040, 0x00000040, 0x10000000,
    0x00040040, 0x10040000, 0x10041040, 0x00041000,
    0x10041000, 0x00041040, 0x00001000, 0x00000040,
    0x10040000, 0x10000040, 0x10001000, 0x00001040,
    0x00041000, 0x00040040, 0x10040040, 0x10041000,
    0x00001040, 0x00000000, 0x00000000, 0x10040040,
    0x10000040, 0x10001000, 0x00041040, 0x00040000,
    0x00041040, 0x00040000, 0x10041000, 0x00001000,
    0x00000040, 0x10040040, 0x00001000, 0x00041040,
    0x10001000, 0x00000040, 0x10000040, 0x10040000,
    0x10040040, 0x10000000, 0x00040000, 0x10001040,
    0x00000000, 0x10041040, 0x00040040, 0x10000040,
    0x10040000, 0x10001000, 0x10001040, 0x00000000,
    0x10041040, 0x00041000, 0x00041000, 0x00001040,
    0x00001040, 0x00040040, 0x10000000, 0x10041000
};
/* PC1: left and right halves bit-swap */
const U32 LHs[16] =
{
    0x00000000, 0x00000001, 0x00000100, 0x00000101,
    0x00010000, 0x00010001, 0x00010100, 0x00010101,
    0x01000000, 0x01000001, 0x01000100, 0x01000101,
    0x01010000, 0x01010001, 0x01010100, 0x01010101
};
const U32 RHs[16] =
{
    0x00000000, 0x01000000, 0x00010000, 0x01010000,
    0x00000100, 0x01000100, 0x00010100, 0x01010100,
    0x00000001, 0x01000001, 0x00010001, 0x01010001,
    0x00000101, 0x01000101, 0x00010101, 0x01010101,
};
/* platform-independant 32-bit integer manipulation macros */
#define GET_UINT32(n,b,i)                    \
{                                            \
    (n) = ( (U32) (b)[(i)    ] << 24 )       \
        | ( (U32) (b)[(i) + 1] << 16 )       \
        | ( (U32) (b)[(i) + 2] <<  8 )       \
        | ( (U32) (b)[(i) + 3]       );      \
}

#define PUT_UINT32(n,b,i)                    \
{                                            \
    (b)[(i)    ] = (U8) ( (n) >> 24 );       \
    (b)[(i) + 1] = (U8) ( (n) >> 16 );       \
    (b)[(i) + 2] = (U8) ( (n) >>  8 );       \
    (b)[(i) + 3] = (U8) ( (n)       );       \
}
/* Initial Permutation macro */
#define DES_IP(T,X,Y)                                             \
{                                                               \
    T = ((X >>  4) ^ Y) & 0x0F0F0F0F; Y ^= T; X ^= (T <<  4);   \
    T = ((X >> 16) ^ Y) & 0x0000FFFF; Y ^= T; X ^= (T << 16);   \
    T = ((Y >>  2) ^ X) & 0x33333333; X ^= T; Y ^= (T <<  2);   \
    T = ((Y >>  8) ^ X) & 0x00FF00FF; X ^= T; Y ^= (T <<  8);   \
    Y = ((Y << 1) | (Y >> 31)) & 0xFFFFFFFF;                    \
    T = (X ^ Y) & 0xAAAAAAAA; Y ^= T; X ^= T;                   \
    X = ((X << 1) | (X >> 31)) & 0xFFFFFFFF;                    \
}
/* Final Permutation macro */
#define DES_FP(T,X,Y)                                             \
{                                                               \
    X = ((X << 31) | (X >> 1)) & 0xFFFFFFFF;                    \
    T = (X ^ Y) & 0xAAAAAAAA; X ^= T; Y ^= T;                   \
    Y = ((Y << 31) | (Y >> 1)) & 0xFFFFFFFF;                    \
    T = ((Y >>  8) ^ X) & 0x00FF00FF; X ^= T; Y ^= (T <<  8);   \
    T = ((Y >>  2) ^ X) & 0x33333333; X ^= T; Y ^= (T <<  2);   \
    T = ((X >> 16) ^ Y) & 0x0000FFFF; Y ^= T; X ^= (T << 16);   \
    T = ((X >>  4) ^ Y) & 0x0F0F0F0F; Y ^= T; X ^= (T <<  4);   \
}
/* DES round macro */
#define DES_ROUND(SK,T,X,Y)                       \
{                                               \
    T = *SK++ ^ X;                              \
    Y ^= SB8[ (T      ) & 0x3F ] ^              \
         SB6[ (T >>  8) & 0x3F ] ^              \
         SB4[ (T >> 16) & 0x3F ] ^              \
         SB2[ (T >> 24) & 0x3F ];               \
                                                \
    T = *SK++ ^ ((X << 28) | (X >> 4));         \
    Y ^= SB7[ (T      ) & 0x3F ] ^              \
         SB5[ (T >>  8) & 0x3F ] ^              \
         SB3[ (T >> 16) & 0x3F ] ^              \
         SB1[ (T >> 24) & 0x3F ];               \
}



/*******************************************************************************
*
*函 数：des_main_ks( )
*功 能：根据8字节的秘钥获取16次迭代运算的子秘钥
*输 入：pSK,子秘钥存储区,pKey,初始密码
*输 出：NONE
*作 者：WGS
*时 间：2019.03.06
*备 注：
*
********************************************************************************/
void des_main_ks(U32 *pSK, U8 *pKey)
{
	U8 i;
	U32 X, Y, T;
	
	GET_UINT32(X, pKey, 0);
	GET_UINT32(Y, pKey, 4);
	/* Permuted Choice 1 */
	T =  ((Y >>  4) ^ X) & 0x0F0F0F0F;  X ^= T; Y ^= (T <<  4);
	T =  ((Y      ) ^ X) & 0x10101010;  X ^= T; Y ^= (T      );
	X =   (LHs[ (X      ) & 0xF] << 3) | (LHs[ (X >>  8) & 0xF ] << 2)
			| (LHs[ (X >> 16) & 0xF] << 1) | (LHs[ (X >> 24) & 0xF ]     )
			| (LHs[ (X >>  5) & 0xF] << 7) | (LHs[ (X >> 13) & 0xF ] << 6)
			| (LHs[ (X >> 21) & 0xF] << 5) | (LHs[ (X >> 29) & 0xF ] << 4);
	Y =   (RHs[ (Y >>  1) & 0xF] << 3) | (RHs[ (Y >>  9) & 0xF ] << 2)
			| (RHs[ (Y >> 17) & 0xF] << 1) | (RHs[ (Y >> 25) & 0xF ]     )
			| (RHs[ (Y >>  4) & 0xF] << 7) | (RHs[ (Y >> 12) & 0xF ] << 6)
			| (RHs[ (Y >> 20) & 0xF] << 5) | (RHs[ (Y >> 28) & 0xF ] << 4);
	X &= 0x0FFFFFFF;
	Y &= 0x0FFFFFFF;
	/* calculate subkeys */
	for( i = 0; i < 16; i++ )
	{
		if( i < 2 || i == 8 || i == 15 )
		{
			X = ((X <<  1) | (X >> 27)) & 0x0FFFFFFF;
			Y = ((Y <<  1) | (Y >> 27)) & 0x0FFFFFFF;
		}
		else
		{
			X = ((X <<  2) | (X >> 26)) & 0x0FFFFFFF;
			Y = ((Y <<  2) | (Y >> 26)) & 0x0FFFFFFF;
		}
		*pSK++ = ((X <<  4) & 0x24000000) | ((X << 28) & 0x10000000)
					 | ((X << 14) & 0x08000000) | ((X << 18) & 0x02080000)
					 | ((X <<  6) & 0x01000000) | ((X <<  9) & 0x00200000)
					 | ((X >>  1) & 0x00100000) | ((X << 10) & 0x00040000)
					 | ((X <<  2) & 0x00020000) | ((X >> 10) & 0x00010000)
					 | ((Y >> 13) & 0x00002000) | ((Y >>  4) & 0x00001000)
					 | ((Y <<  6) & 0x00000800) | ((Y >>  1) & 0x00000400)
		  		 | ((Y >> 14) & 0x00000200) | ((Y      ) & 0x00000100)
					 | ((Y >>  5) & 0x00000020) | ((Y >> 10) & 0x00000010)
					 | ((Y >>  3) & 0x00000008) | ((Y >> 18) & 0x00000004)
					 | ((Y >> 26) & 0x00000002) | ((Y >> 24) & 0x00000001);
		*pSK++ = ((X << 15) & 0x20000000) | ((X << 17) & 0x10000000)
			     | ((X << 10) & 0x08000000) | ((X << 22) & 0x04000000)
				   | ((X >>  2) & 0x02000000) | ((X <<  1) & 0x01000000)
					 | ((X << 16) & 0x00200000) | ((X << 11) & 0x00100000)
					 | ((X <<  3) & 0x00080000) | ((X >>  6) & 0x00040000)
					 | ((X << 15) & 0x00020000) | ((X >>  4) & 0x00010000)
					 | ((Y >>  2) & 0x00002000) | ((Y <<  8) & 0x00001000)
					 | ((Y >> 14) & 0x00000808) | ((Y >>  9) & 0x00000400)
					 | ((Y      ) & 0x00000200) | ((Y <<  7) & 0x00000100)
					 | ((Y >>  7) & 0x00000020) | ((Y >>  3) & 0x00000011)
					 | ((Y <<  2) & 0x00000004) | ((Y >> 21) & 0x00000002);
	}
}

/*******************************************************************************
*
*函 数：des_set_key( )
*功 能：获取加解密秘钥
*输 入：pKey,秘钥,ctx,加解密秘钥存储区
*输 出：NONE
*作 者：WGS
*时 间：2019.03.06
*备 注：
*
********************************************************************************/
void des_set_key(des_context *ctx, U8 *pKey)
{
	U8 i;
	des_main_ks(ctx->esk, pKey); //setup encryption subkeys
	for(i = 0; i < 32; i += 2)   //setup decryption subkeys
	{
		ctx->dsk[i    ] = ctx->esk[30 - i];
		ctx->dsk[i + 1] = ctx->esk[31 - i];
	}
}

/*******************************************************************************
*
*函 数：des_crypt( )
*功 能：DES 64-bit block encryption/decryption
*输 入：pSK,加解密秘钥,pInput,输入数据,pOut,输出数据
*输 出：输出数据个数
*作 者：WGS
*时 间：2019.03.06
*备 注：
*
********************************************************************************/
void des_crypt(U32 *pSK, U8 *pInput, U8 *pOutput)
{
	U32 X, Y, T;
	
	GET_UINT32(X, pInput, 0);
	GET_UINT32(Y, pInput, 4);
	DES_IP(T, X, Y);
	DES_ROUND(pSK,T,Y,X);  DES_ROUND(pSK,T,X,Y);
	DES_ROUND(pSK,T,Y,X);  DES_ROUND(pSK,T,X,Y);
	DES_ROUND(pSK,T,Y,X);  DES_ROUND(pSK,T,X,Y);
	DES_ROUND(pSK,T,Y,X);  DES_ROUND(pSK,T,X,Y);
	DES_ROUND(pSK,T,Y,X);  DES_ROUND(pSK,T,X,Y);
	DES_ROUND(pSK,T,Y,X);  DES_ROUND(pSK,T,X,Y);
	DES_ROUND(pSK,T,Y,X);  DES_ROUND(pSK,T,X,Y);
	DES_ROUND(pSK,T,Y,X);  DES_ROUND(pSK,T,X,Y);
	DES_FP(T,Y, X);
	PUT_UINT32(Y, pOutput, 0);
	PUT_UINT32(X, pOutput, 4);
}

/*******************************************************************************
*
*函 数：DES_Encrypt( )
*功 能：DES加密
*输 入：pKey,初始秘钥,pInput,输入数据,uInputSize,输入数据个数,pOut,输出数据
*输 出：输出数据个数
*作 者：WGS
*时 间：2019.03.06
*备 注：
*
********************************************************************************/
U8 DES_Encrypt(U8* pKey,U8* pInput,U8 uInputSize,U8* pOut)
{
	des_context sCtx;
	U8 iCount, i,*p,*po = pOut;
	U8 BUF[64];

	memset(BUF,0,64);
	memcpy(BUF,pInput,uInputSize);
	p = BUF;
	des_set_key(&sCtx, pKey);
	iCount = uInputSize / 8; 
	if((uInputSize % 8) != 0)
		iCount ++;
	for (i = 0; i < iCount; i ++)
	{
		des_crypt(sCtx.esk, p, po);
		p += 8;	
		po += 8;
	}
	return iCount*8;
}

/*******************************************************************************
*
*函 数：DES_Encrypt( )
*功 能：DES解密
*输 入：pKey,初始秘钥,pInput,输入数据,uInputSize,输入数据个数,pOut,输出数据
*输 出：输出数据个数
*作 者：WGS
*时 间：2019.03.06
*备 注：
*
********************************************************************************/
U8 DES_Decrypt(U8 *pKey,U8* pInput,U8 uInputSize,U8* pOut)
{
	des_context sCtx;
	U8 iCount, i;
	U8 *p  = pInput;
	U8 *po = pOut;

	des_set_key(&sCtx,pKey);
	iCount = uInputSize / 8;
	if((uInputSize % 8) != 0)    //解密时输入的数据个数一定是8的倍数
		return 0; 
	for(i = 0; i < iCount; i ++)
	{
		des_crypt(sCtx.dsk,p, po);
		p += 8;
		po += 8;
	}
	
	return iCount*8;
}
/*******************************************************************************
*
*函 数：LZWL_DES_Decrypt( )
*功 能：解密打包
*输 入：pKey,初始秘钥,pInput,输入数据,uInputSize,输入数据个数,pOut,输出数据
*输 出：输出数据个数
*作 者：CK
*时 间：2019.03.06
*备 注：
*
********************************************************************************/
uint8_t LZWL_DES_Decrypt(U8 *pKey,U8* pInput,U8 uInputSize,U8* pOut)
{
  return DES_Decrypt(pKey,pInput,uInputSize,pOut);
}
/*******************************************************************************
*
*函 数：LZWL_DES_Encrypt( )
*功 能：加密打包
*输 入：pKey,初始秘钥,pInput,输入数据,uInputSize,输入数据个数,pOut,输出数据
*输 出：输出数据个数
*作 者：CK
*时 间：2019.03.06
*备 注：
*
********************************************************************************/
uint8_t LZWL_DES_Encrypt(U8 *pKey,U8* pInput,U8 uInputSize,U8* pOut)
{
  return DES_Encrypt(pKey,pInput,uInputSize,pOut);
}
/*******************************************************************************
*
*函 数：des3_set_3keys( )
*功 能：设置3DES加解密秘钥
*输 入：pKey,秘钥,ctx,加解密秘钥存储区
*输 出：NONE
*作 者：WGS
*时 间：2019.03.14
*备 注：
*
********************************************************************************/
void des3_set_3keys(des3_context *ctx, U8 *pKey1, U8 *pKey2,U8 *pKey3)
{
	U8 i;
	des_main_ks(ctx->esk     , pKey1);
	des_main_ks(ctx->dsk + 32, pKey2);
	des_main_ks(ctx->esk + 64, pKey3);
	for(i = 0; i < 32; i += 2)
	{
		ctx->dsk[i     ] = ctx->esk[94 - i];
		ctx->dsk[i +  1] = ctx->esk[95 - i];
		ctx->esk[i + 32] = ctx->dsk[62 - i];
		ctx->esk[i + 33] = ctx->dsk[63 - i];
		ctx->dsk[i + 64] = ctx->esk[30 - i];
		ctx->dsk[i + 65] = ctx->esk[31 - i];
	}
}

/*******************************************************************************
*
*函 数：des_crypt( )
*功 能：DES 64-bit block encryption/decryption
*输 入：pSK,加解密秘钥,pInput,输入数据,pOut,输出数据
*输 出：输出数据个数
*作 者：WGS
*时 间：2019.03.06
*备 注：
*
********************************************************************************/
void des3_crypt(U32 *pSK, U8 *pInput,U8 *pOutput)
{
	U32 X, Y, T;
	
	GET_UINT32( X, pInput, 0 );
	GET_UINT32( Y, pInput, 4 );
	DES_IP(T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, X, Y );  DES_ROUND(pSK,T, Y, X );
	DES_ROUND(pSK,T, X, Y );  DES_ROUND(pSK,T, Y, X );
	DES_ROUND(pSK,T, X, Y );  DES_ROUND(pSK,T, Y, X );
	DES_ROUND(pSK,T, X, Y );  DES_ROUND(pSK,T, Y, X );
	DES_ROUND(pSK,T, X, Y );  DES_ROUND(pSK,T, Y, X );
	DES_ROUND(pSK,T, X, Y );  DES_ROUND(pSK,T, Y, X );
	DES_ROUND(pSK,T, X, Y );  DES_ROUND(pSK,T, Y, X );
	DES_ROUND(pSK,T, X, Y );  DES_ROUND(pSK,T, Y, X );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_ROUND(pSK,T, Y, X );  DES_ROUND(pSK,T, X, Y );
	DES_FP(T, Y, X );
	PUT_UINT32(Y, pOutput, 0 );
	PUT_UINT32(X, pOutput, 4 );
}

/*******************************************************************************
*
*函 数：DES_TripleDecrypt( )
*功 能：3DES加密
*输 入：pKey,初始秘钥,pInput,输入数据,uInputSize,输入数据个数,pOut,输出数据
*输 出：解密的结果
*作 者：WGS
*时 间：2019.03.14
*备 注：
*
********************************************************************************/
uint8_t DES_TripleEncrypt(U8* pKey,U8* pInput,U8 uInputSize,U8* pOut)
{
	des3_context sCtx;
	sha256_context sha_ctx;
	U8 iCount, i,*p,*po = pOut;
	U8 BUF[128],digest[32]={0};

	memset(BUF,0,128);
	memcpy(BUF,pInput,uInputSize);
	p = BUF;
	SHA256_Starts(&sha_ctx);
	SHA256_Update(&sha_ctx,pKey,8);
	SHA256_Finish(&sha_ctx, digest);
	des3_set_3keys(&sCtx,digest,&digest[8],&digest[16]);
	iCount = uInputSize / 8; 
	if((uInputSize % 8) != 0)
		iCount ++;
	for (i = 0; i < iCount; i ++)
	{
		des3_crypt(sCtx.esk,p,po);
		p  += 8;	
		po += 8;
	}
	return iCount*8;
}

/*******************************************************************************
*
*函 数：DES_TripleDecrypt( )
*功 能：3DES解密
*输 入：pKey,初始秘钥,pInput,输入数据,uInputSize,输入数据个数,pOut,输出数据
*输 出：解密的结果
*作 者：WGS
*时 间：2019.03.14
*备 注：
*
********************************************************************************/
uint8_t DES_TripleDecrypt(U8 *pKey,U8 *pInput,U8 uInputSize,U8 *pOut)
{
	sha256_context sha_ctx;
	des3_context   sCtx;
	U8 digest[32]={0};
	U8 iCount, i,*p = pInput,*po = pOut;
	
	SHA256_Starts(&sha_ctx);
	SHA256_Update(&sha_ctx,pKey,8);
	SHA256_Finish(&sha_ctx, digest);
	des3_set_3keys(&sCtx,digest,&digest[8],&digest[16]);
	iCount = uInputSize / 8;
	if((uInputSize % 8) != 0)
	{
		return 0;
	}
	else
	{
		for(i = 0; i < iCount; i++ )
		{
			des3_crypt(sCtx.dsk,p,po);
			p  += 8;
			po += 8;
		}
	}
	return iCount*8;;
}
/*******************************************************************************
*
*函 数：LZWL_DES_Decrypt( )
*功 能：解密打包
*输 入：pKey,初始秘钥,pInput,输入数据,uInputSize,输入数据个数,pOut,输出数据
*输 出：输出数据个数
*作 者：CK
*时 间：2019.03.06
*备 注：
*
********************************************************************************/
uint8_t LZWL_DES_TripleDecrypt(U8 *pKey,U8* pInput,U8 uInputSize,U8* pOut)
{
  return DES_TripleDecrypt(pKey,pInput,uInputSize,pOut);
}
/*******************************************************************************
*
*函 数：LZWL_DES_Encrypt( )
*功 能：加密打包
*输 入：pKey,初始秘钥,pInput,输入数据,uInputSize,输入数据个数,pOut,输出数据
*输 出：输出数据个数
*作 者：CK
*时 间：2019.03.06
*备 注：
*
********************************************************************************/
uint8_t LZWL_DES_TripleEncrypt(U8 *pKey,U8* pInput,U8 uInputSize,U8* pOut)
{
  return DES_TripleEncrypt(pKey,pInput,uInputSize,pOut);
}